# массив из 15 чисел
arr = [10, 7, 15, 23, 30, 8, 5, 11, 25, 40, 6, 9, 55, 12, 100]

for num in arr:
    if num % 5 == 0:
        print(f"{num} делится на 5")
    else:
        print(f"{num} не делится на 5")
A = [
    [1, 2, 3, 4],
    [5, 6, 7, 8],
    [9, 10, 11, 12],
    [13, 14, 15, 16]
]

product = 1
for i in range(4):
    for j in range(4):
        if i > j:  # ниже главной диагонали
            product *= A[i][j]

print("Произведение элементов ниже главной диагонали:", product)
